Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: གཞོན་ནུ་བཅུ་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་ལྷུར་བྱེད་པ། ཆོས་ཀྱི་སྦྱིན་པ་སྦྱིན་པར་བྱེད་པའི་ཕན་ཡོན་ནོ།
en: and [10] they attain happiness in this life. “Young man, for bodhisattva mahāsattvas who are intent on giving the Dharma, those are the ten benefits that come from giving the Dharma.”

source: །དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ། སུ་དག་སེར་སྣ་མེད་པར་ནི།
en: On this topic, it was said:

source: །ཆོས་ཀྱི་སྦྱིན་པ་མཆོག་སྦྱིན་བྱེད།
en: “Those who give the supreme gift, The gift of the Dharma, are not misers. The Lord of the World has taught

source: །དེ་ཡི་ལེགས་པ་རྣམ་བཅུར་ནི། །འཇིག་རྟེན་མགོན་པོས་རབ་ཏུ་བཤད།
en: That they will have ten benefits. {41}

source: །བྱ་བ་མ་ཡིན་ཐམས་ཅད་སྤོང་།
en: “They reject all that should not be done;

source: །མཁས་པ་བྱ་བ་རྣམས་ལ་འཇུག །སྐྱེས་བུ་དམ་པའི་ཆོས་ལ་དད།
en: The wise ones engage in what should be done. They obtain the Dharma of a worthy person

source: །གཏོང་བའི་སེམས་ལ་སྟེན་པར་བྱེད།
en: And maintain a motivation of generosity. {42}

source: །སངས་རྒྱས་ཞིང་ཡང་རྣམ་སྦྱོང་སྟེ།
en: “They purify a buddha realm.

source: །དེ་ཡི་ཞིང་ནི་བསམ་མི་ཁྱབ།
en: Their realm is inconceivable.

source: །བྱང་ཆུབ་སྙིང་པོར་རྟག་ཏུ་འདུག །ཆོས་ཀྱི་སྦྱིན་པའི་འབྲས་བུ་འདི།
en: They are always on the Bodhimaṇḍa, Which is the result of giving the Dharma. {43}

source: །དངོས་པོ་ཐམས་ཅད་གཏོང་བྱེད་ཅིང་།
en: “They give away all material things.

source: །ཆོས་ཀྱི་རྒྱལ་པོའི་རྗེས་སུ་སློབ།
en: They follow the king of the Dharma.

source: །ཉོན་མོངས་པ་ཡང་ཚར་བཅད་པ།
en: For those who have overcome the kleśas,

source: །སེམས་ཅན་ཀུན་ན་སྐལ་བའི་ཤས། །བྱམས་པའི་སེམས་ཀྱིས་རབ་ཏུ་སྦྱིན།
en: Their portion to all beings.

source: །དེ་ནི་ཕྲག་དོག་མེད་འགྱུར་ཏེ།
en: They are those who have no envy,

source: །མི་མ་ཡིན་པའི་སྐྱིད་པ་འཐོབ། །མཁས་པས་བྱ་བ་མ་ཡིན་རྣམ་སྤངས་ཏེ།
en: And they have a happiness higher than that of humans. {45} “They are learned people who reject what should not be done. They are wise people who are always doing what should be done.

source: །རྟོགས་པར་བྱ་བ་དག་ལ་གནས་པར་བྱེད།
en: They always follow the Dharma of great beings.

source: །མཁས་པ་སུ་དག་ཆོས་ཀྱི་སྦྱིན་པ་གཏོང་། །བདག་ཉིད་ཆེན་པོའི་ཆོས་ལ་རྟག་ཏུ་གནས།
en: They are learned people who always give the gift of the Dharma. {46}

source: །དེ་ཡི་ཞིང་ཡང་རྣམ་པར་དག་པར་འགྱུར།
en: “Their realm is one that is always pure.

source: །བྱང་ཆུབ་ཕྱོགས་ཀྱི་ཆོས་རྣམས་རྣམ་པར་འཕེལ།
en: They increase those qualities that are aspects of enlightenment.

source: །བྱང་ཆུབ་སྙིང་པོར་རྟག་ཏུ་ཉེ་བར་འགྱུར།
en: They are always close to the Bodhimaṇḍa.

source: །ཆོས་རྣམས་བྱིན་པའི་ཕན་ཡོན་འདི་དག་གོ།
en: Those are the benefits of giving the Dharma. {47}

source: །ཉོན་མོངས་མེད་ཅིང་དངོས་པོ་ཡོངས་སུ་བཏང་།
en: “They have no kleśas, and give material things away.

source: །དངོས་པོའི་རང་གི་མཚན་ཉིད་རབ་ཏུ་ཤེས།
en: They know the characteristics of things.

source: །ཡོངས་སུ་འཛིན་པ་ཀུན་ལས་རྣམ་པར་གྲོལ།
en: They are liberated from all attachment.

source: །དེ་ལ་ཆགས་པ་ནམ་ཡང་ཡོང་མི་འགྱུར།
en: They never have any impediments. {48}

source: །མཁས་པའི་སེམས་ནི་ཤིན་ཏུ་ཉེར་གཞག་པ།
en: “They have a wise one’s mind.

source: །སེམས་ཅན་ཐམས་ཅད་བདེ་བར་གྱུར་ཅིག་ཅེས།
en: They wish for all beings to be happy.

source: །དེ་ནི་བྱམས་སེམས་འགྱུར་ཞིང་ཕྲག་དོག་མེད།
en: They have loving minds free of envy,

source: །ཚེ་འདི་དག་ལའང་བདེ་བ་མི་ཉུང་འགྱུར།
en: And in this life their happiness is not little. {49}

source: །གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྟོང་པ་ཉིད་ལ་གནས་པའི་ཕན་ཡོན་ནི་འདི་བཅུ་སྟེ།
en: “Young man, there are ten benefits for bodhisattva mahāsattvas who dwell in emptiness.

source: སངས་རྒྱས་ཀྱི་སྤྱོད་པ་ལ་གནས་པ་དང་མི་གནས་པར་བསམ་གཏན་བྱེད་པ་དང་། སྐྱེ་བ་ལ་མི་སྨོན་པ་དང་ཚུལ་ཁྲིམས་ལ་མཆོག་ཏུ་མི་འཛིན་པ་དང་འཕགས་པ་ལ་མི་སྐུར་བ་དང་མི་འགལ་བར་གནས་པ་དང་དངོས་པོ་མི་དམིགས་པ་དང་དབེན་པར་གྱུར་པ་དང་། སངས་རྒྱས་ལ་སྐུར་པ་མི་འདེབས་པ་དང་། དམ་པའི་ཆོས་འཛིན་པ་སྟེ།
en: they dwell in the dwelling of the Buddha; [2] their meditation is nondwelling; [3] they are not intent on rebirth; [4] they have no clinging to conduct; [5] they do not criticize superior beings; [6] they live in an appropriate manner; [7] they do not conceptualize the objects of perception; [8] they remain detached; [9] they do not disparage the buddhas; and [10] they possess the Dharma.

source: གཞོན་ནུ་བཅུ་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྟོང་པ་ཉིད་ལ་གནས་པའི་ཕན་ཡོན་ནོ།
en: “Young man, those are the ten benefits for bodhisattva mahāsattvas who dwell in emptiness.”

source: །མི་དབང་གནས་པ་གང་ཡིན་པ།
en: The dwelling of the lords of men

source: །སངས་རྒྱས་ཀུན་གྱི་སྤྱོད་ཡུལ་ཏེ། །དེས་ནི་རྣལ་འབྱོར་གནས་པར་བྱེད།
en: And the field of activity of all the buddhas,

source: །དེ་ལ་སྲོག་རྣམས་དམིགས་པ་མེད།
en: Without the conception of a life. {50}

source: །འཇིག་རྟེན་ཀུན་ལ་མི་གནས་ཤིང་།
en: “Without dependence on any existence

source: །འཕགས་པའི་བསམ་གཏན་མི་གཏོང་སྟེ།
en: They never give up the superior dhyāna.

source: །ཆོས་ཀྱི་རང་བཞིན་མཐོང་ནས་ནི།
en: Having seen the nature of phenomena

source: །སྐྱེ་བ་ལ་ཡང་སྨོན་མི་བྱེད།
en: They have no intention of being reborn. {51} “Those who have no clinging to conduct

source: །ཚུལ་ཁྲིམས་མཆོག་ཏུ་མི་འཛིན་ཅིང་།
en: Will not be dependent on conduct.

source: །ཚུལ་ཁྲིམས་ལ་ཡང་གནས་མི་བྱེད།
en: They do not criticize in any way

source: །ཟག་པ་མེད་པའི་ལམ་གཞན་ལ། །ཅུང་ཟད་སྐུར་པར་དེ་མི་བྱེད།
en: Another superior being who is without defilement. {52}

source: །འགལ་བ་མེད་པར་དེ་གནས་ཤིང་།
en: “They live in an appropriate manner

source: །རྩོད་པ་དག་ཀྱང་ཡོང་མེད་དེ།
en: And are not known to quarrel.

source: །རྣལ་འབྱོར་དངོས་པོ་མི་དམིགས་ཤིང་།
en: The yogins do not conceptualize things

source: །རྟག་ཏུ་དབེན་པར་གནས་པར་བྱེད།
en: But live always detached. {53} “They do not disparage the Buddha

source: །དེ་ནི་སྲོག་གི་དོན་ཕྱིར་ཡང་། །སངས་རྒྱས་སྐུར་པ་མི་འདེབས་ཏེ།
en: Even for the sake of their life.

source: །སྟོང་པ་ཉིད་ལ་དེས་གྱུར་ཅིང་། །ལུས་ཀྱི་མངོན་སུམ་འཇིགས་པ་མེད།
en: While remaining in the emptiness of phenomena They are fearlessly visible in their body. {54} “They teach the Dharma with veneration For the inconceivable enlightenment of buddhahood

source: །འཇིག་རྟེན་མགོན་པོ་ཐམས་ཅད་ཀྱི། །སངས་རྒྱས་བྱང་ཆུབ་བསམ་མི་ཁྱབ། །གུས་པར་བྱས་ནས་ཆོས་འཛིན་ཏེ། །སངས་རྒྱས་ཆོས་ལ་ནེམ་ནུར་མེད།
en: Of all the lords of the worlds, And they have no doubt in the Dharma of the Buddha. {55} “The dwelling place of the supreme individuals,

source: །གང་དག་མུ་སྟེགས་མང་པོའི་ས་མ་ཡིན།
en: The level not that of the many kinds of tīrthika,

source: །སྐྱེས་བུ་ཁྱུ་མཆོག་གི་ནི་གནས་པ་དེ། །གང་ལ་སྲོག་མེད་གང་ཟག་སེམས་ཅན་མེད།
en: There where there is no being, soul, or person:

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་གནས་པར་བྱེད།
en: That is where the bodhisattvas dwell. {56}

source: །དེ་ལ་གནས་པ་ནམ་ཡང་ཡོད་མ་ཡིན།
en: “They have no dwelling whatsoever.

source: །མི་གནས་པར་ནི་བསམ་གཏན་བདེ་བ་སྟེན།
en: They remain in the bliss of nondwelling dhyāna.

source: །ཆོས་ལ་སེམས་ཅན་བདག་མེད་རྣམ་རིག་པས།
en: They see that phenomena have no self, no being,

source: །སྐྱེ་བར་ཡང་ནི་འདུ་ཤེས་ཡོང་མི་འབྱུང་།
en: And they do not give rise to the concept of creation. {57}

source: །ཆོས་རྣམས་ཀྱི་ནི་རང་བཞིན་རྣམ་པར་རིག །ཚུལ་ཁྲིམས་ལ་ཡང་ཅུང་ཟད་གནས་པ་མེད།
en: “They understand the nature of phenomena. They have no dependence even on conduct.

source: །ཚུལ་ཁྲིམས་ཀྱིས་ནི་དག་པར་ཡེངས་མི་སེམས།
en: They do not conceive of themselves as pure because of conduct,

source: །སངས་རྒྱས་དག་ལ་རྟག་ཏུ་དད་པར་བྱེད།
en: And always have faith in the buddhas. {58}

source: །ཐམས་ཅད་རང་བཞིན་སྟོང་པར་རྣམ་བསྒོམས་པས།
en: “They meditate on the empty nature of all phenomena

source: །དེ་ལ་འགལ་བ་ནམ་ཡང་འབྱུང་མི་འགྱུར།
en: And they are never in any way inappropriate.

source: །དེ་བཞིན་གཤེགས་པའི་དམ་ཆོས་བཟུང་ནས་ནི།
en: They possess the pure Dharma of the tathāgatas

source: །འདྲེན་པ་དག་ལ་ནམ་ཡང་མི་སྐུར་ཏོ།
en: And do not disparage the guides. {59}

source: །གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནང་དུ་ཡང་དག་པར་འཇོག་ལ་མངོན་པར་བརྩོན་པའི་ཕན་ཡོན་ནི་འདི་བཅུ་སྟེ།
en: “Young man, there are ten benefits for bodhisattva mahāsattvas who remain intently in meditative seclusion.

source: སེམས་རྙོག་པ་མེད་པ་དང་། བག་ཡོད་པར་གནས་པ་དང་། སངས་རྒྱས་རྗེས་སུ་དྲན་པ་དང་། སྤྱོད་པ་ལ་དད་པ་དང་ཡེ་ཤེས་ལ་ནེམ་ནུར་མེད་པ་དང་སངས་རྒྱས་ལ་བྱས་པ་གཟོ་བ་དང་ཆོས་མི་སྤོང་བ་དང་ཤིན་ཏུ་བསྡམས་པར་གནས་པ་དང་དུལ་བའི་ས་རྗེས་སུ་ཐོབ་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་མངོན་སུམ་དུ་བྱེད་པ་སྟེ།
en: they keep the Buddha in mind; [4] they have faith in bodhisattva conduct; [5] they have no uncertainty concerning wisdom; [6] they have gratitude toward the buddhas; [7] they do not abandon the Dharma; [8] they maintain vows perfectly; [9] they have attained the level of self-discipline; and [10] they have the direct perception of the four discernments.

source: གཞོན་ནུ་བཅུ་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནང་དུ་ཡང་དག་པར་འཇོག་ལ་མངོན་པར་བརྩོན་པའི་ཕན་ཡོན་ནོ།
en: “Young man, those are the ten benefits for bodhisattva mahāsattvas who remain intently in meditative seclusion.”

source: དེ་ཡི་སེམས་ནི་རྙོག་པ་མེད།
en: “Their minds are unpolluted.

source: །བག་མེད་ཐམས་ཅད་རྣམ་སྤངས་ཏེ།
en: They have rejected all carelessness.

source: །བག་ཡོད་ལ་ཡང་གནས་བྱེད་ཅིང་།
en: They maintain carefulness.

source: །ཡང་དག་འཇོག་ལ་སྤྱོད་ཡུལ་བ།
en: Their field of activity is meditative seclusion. {60}

source: །འཇིག་རྟེན་མགོན་གྱི་སྤྱོད་ཐོས་ནས། །སངས་རྒྱས་ལ་ནི་དད་པར་བྱེད། །སངས་རྒྱས་ཡེ་ཤེས་བསམ་མི་ཁྱབ།
en: “They have faith in the buddhas, having heard Of the conduct of the Lord of the World.

source: །ཡེ་ཤེས་རྣལ་འབྱོར་ཐེ་ཚོམ་མེད།
en: The yogins have no doubt concerning wisdom, The inconceivable wisdom of the buddhas. {61}

source: །སངས་རྒྱས་རྣམས་ལ་བྱས་པ་གཟོ།
en: “They have gratitude toward the buddhas,

source: །སངས་རྒྱས་ཆོས་ལ་ཐེ་ཚོམ་མེད།
en: And have no doubt concerning the Dharma of the buddhas.

source: །ཤིན་ཏུ་བསྡམས་ཤིང་གནས་བྱེད་དེ།
en: They maintain their vows perfectly,

source: །དུལ་བའི་ས་ལ་རབ་ཏུ་གནས།
en: And have attained the level of self-discipline. {62}

source: །ཡང་དག་རིག་པ་དེས་ཐོབ་སྟེ། །རྙེད་དང་བཀུར་སྟི་སྤངས་ནས་སུ།
en: “They have attained discernment.

source: །གཅིག་པུ་ནགས་ཁྲོད་མོས་པར་བྱེད།
en: They delight in being alone in the forest. They have forsaken gain and honors,

source: །དེ་ཡི་སེམས་ནི་རྙོག་པ་མེད་པར་འགྱུར།
en: “Their minds are unpolluted.

source: །བག་མེད་པ་ཡང་ཐམས་ཅད་ཡོངས་སྤངས་ཏེ།
en: They have forsaken all carelessness.

source: །བདག་ཉིད་ཆེན་པོ་རྟག་ཏུ་བག་ཡོད་འགྱུར།
en: They are great beings who are always careful.

source: །རྐང་གཉིས་གཙོ་བོ་སངས་རྒྱས་དྲན་ནས་ནི།
en: “They keep in mind the buddhas, the supreme humans,

source: །དེ་ཡི་སྤྱོད་པ་བླ་ན་མེད་ལ་དད།
en: And they have faith in their supreme conduct.

source: །དེ་བཞིན་གཤེགས་པའི་མཁྱེན་ལ་ཐེ་ཚོམ་མེད།
en: They do not doubt the wisdom of the tathāgatas.

source: །སངས་རྒྱས་དག་ལ་རྟག་ཏུ་བྱས་པ་གཟོ།
en: “They always have gratitude toward the buddhas.

source: །དེ་ནི་སྲོག་གི་ཕྱིར་ཡང་ཆོས་མི་སྤོང་།
en: They do not forsake the Dharma even for the sake of their life.

source: །ཐམས་ཅད་དུས་སུ་ཤིན་ཏུ་བསྡམས་པར་གནས།
en: At all times they keep their vows perfectly.

source: །ཤིན་ཏུ་དུལ་བའི་ས་ནི་རྗེས་ཐོབ་ཅིང་།
en: “They have attained the level of self-discipline.

source: །ཡང་དག་རིག་པ་མྱུར་དུ་མངོན་སུམ་བྱེད།
en: They quickly attain the direct perception of discernment.

source: །ཚིག་གི་རྒྱུན་མི་འཆད་ཅིང་སྤོབས་པར་ལྡན།
en: They speak with the unceasing confidence of speech.

source: །མདོ་སྡེ་བྱེ་བ་ཁྲག་ཁྲིག་སྟོན་པར་བྱེད།
en: They teach millions and billions of sūtras. {67}

source: །སངས་རྒྱས་བྱང་ཆུབ་མྱུར་དུ་དེ་འཛིན་ཏེ།
en: “They quickly attain the enlightenment of buddhahood.

source: །འདྲེན་པ་དག་གིས་བསྟན་པ་ཡོངས་སུ་སྲུང་།
en: They protect the teaching of the Guide.

source: །དེས་ནི་ཕ་རོལ་རྒོལ་བ་ཀུན་བཅོམ་སྟེ།
en: They defeat all who are adversaries.

source: །སངས་རྒྱས་ཀྱི་ཡང་བྱང་ཆུབ་རྒྱས་པར་བྱེད།
en: They extensively propagate the enlightenment of buddhahood. {68}

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཤི་འཕོས་ནས།
en: “When those bodhisattvas pass away,

source: །བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་ཁམས་སུ་འགྲོ།
en: They go to the realm of Sukhāvatī.

source: །ཚེ་དཔག་མེད་ལས་ཆོས་བཟང་མཆོག་ཐོས་ནས།
en: They hear the highest Dharma from Amitāyus

source: །སྐྱེ་བ་མེད་པའི་ཆོས་ལ་བཟོད་པ་འཐོབ།། །།འཕགས་པ་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོའི་མདོ།
en: And attain the acceptance of the nonorigination of phenomena. {69}

source: བམ་པོ་དགུ་པ། གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགོན་པར་གནས་པ་ལྷུར་བྱེད་པ་དག་གི་ཕན་ཡོན་ནི་འདི་བཅུ་སྟེ། བཅུ་གང་ཞེ་ན།
en: “Young man, there are ten benefits for bodhisattva mahāsattvas who are dedicated to solitude. What are the ten benefits? They are: [1] they have few activities; [2] they have gone far from busy crowds; [3] they have no quarrels; [4]

source: བྱ་བ་ཉུང་བར་གནས་པ་དང་འདུ་འཛི་རིང་བ་ནས་ཀྱང་རིང་དུ་སྤོང་བ་དང་དེ་ལ་རྩོད་པ་མེད་པར་འགྱུར་བ་དང་། གནོད་པ་མེད་པར་གནས་པ་དང་ཟག་པ་འཕེལ་བར་མི་བྱེད་པ་དང་རྩོད་པའི་གཞིར་མི་བྱེད་པ་དང་ཤིན་ཏུ་ཞི་བར་སྤྱོད་པ་དང་ཤིན་ཏུ་བསྡམས་པར་གནས་པ་དང་ཐར་པ་དང་འཐུན་པའི་སེམས་ཀྱི་རྒྱུད་དུ་འགྱུར་བ་དང་། མྱུར་དུ་རྣམ་པར་གྲོལ་བ་མངོན་སུམ་དུ་བྱེད་པ་སྟེ།
en: they do not increase defilements; [6] they do not create any cause for disputes; [7] they have perfectly peaceful conduct; [8] they maintain perfect self-restraint; [9] their minds are prepared for liberation; and [10] they quickly manifest liberation.

source: གཞོན་ནུ་བཅུ་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགོན་པར་གནས་པ་ལྷུར་བྱེད་པའི་ཕན་ཡོན་ནོ།
en: “Young man, those are the ten benefits for bodhisattva mahāsattvas who are dedicated to solitude.”

source: རྟག་ཏུ་བྱ་བ་ཉུང་བར་འགྱུར།
en: “They always have few activities.

source: །འདུ་འཛི་དག་ཀྱང་རིང་དུ་སྤོང་།
en: They have gone far from busy crowds.

source: །ནགས་ཁྲོད་གཅིག་པུ་གནས་པ་ནི། །རྩོད་པ་དག་ཀྱང་དེ་ལ་མེད།
en: They have no quarrels. They live alone in the forest. {70}

source: །གནོད་པ་མེད་པའི་སེམས་ཀྱིས་ནི།
en: “Without an intention to cause harm

source: །ཟག་པ་རྣམ་པར་འཕེལ་མི་བྱེད།
en: They do not increase their defilements.

source: །དེ་ལ་རྩོད་གཞི་མི་འབྱུང་སྟེ།
en: They have no cause for disputes.

source: །དགོན་པར་གནས་པའི་ཡོན་ཏན་འདི།
en: Those are the qualities of living in a forest. {71} “They are peaceful in their conduct.

source: །ལུས་དང་ངག་ཡིད་རབ་བསྡམས་ཏེ། །དེ་ནི་ཉེ་བར་ཞི་བར་སྤྱོད།
en: They restrain their body, speech, and mind.

source: །ཐར་པ་དང་ནི་འཐུན་གྱུར་ཅིང་།
en: They are prepared for liberation;

source: །རྣམ་པར་གྲོལ་བ་མྱུར་དུ་རིག །རྣལ་འབྱོར་པ་ནི་རྟག་ཏུ་བྱ་བ་ཉུང་།
en: They will quickly reach liberation. {72} “They are yogins who always have few activities.

source: །འདུ་འཛི་མང་པོའི་ཉེས་པ་ཀུན་སྤངས་ཏེ།
en: They have shunned the many faults of busy gatherings.

source: །རྣལ་འབྱོར་པ་དག་ནམ་ཡང་རྩོད་མི་བྱེད།
en: The yogins do not ever quarrel.

source: །དགོན་པར་གནས་པའི་ཕན་ཡོན་འདི་དག་གོ།
en: Those are the qualities of living in a solitary place. {73}

source: །ནམ་ཞིག་དེ་ནི་འདུས་བྱས་སྐྱོ་གྱུར་ཅིང་།
en: “When they have become saddened by the composite,

source: །འཇིག་རྟེན་དུ་ནི་གང་ལའང་འདོད་པ་མེད།
en: They never harbor any longing for the world,

source: །ཟག་པ་དག་ཀྱང་འཕེལ་བར་མི་བྱེད་པ།
en: And they do not increase their defilements.

source: །ནགས་ཁྲོད་གནས་པ་དེ་ཡི་ཕན་ཡོན་ཡིན།
en: The ones who live in a forest gain these benefits. {74}

source: །དེ་ལ་རྩོད་གཞི་ནམ་ཡང་མི་འབྱུང་སྟེ།
en: “There never arises in them a cause for disputes.

source: །རྟག་ཏུ་ཞི་ལ་དགའ་ཞིང་དབེན་པར་སྤྱོད།
en: They live in solitude, delighting in peace.

source: །ལུས་དང་ངག་དང་ཡིད་ཀྱང་བསྡམས་པ་སྟེ།
en: Their body, speech, and mind are restrained.

source: །དགོན་པར་གནས་པ་དེ་ལ་ཡོན་ཏན་མང་།
en: The ones who live in solitude will have many qualities. {75}

source: །དེ་ནི་ཐར་པ་དང་ཡང་འཐུན་གྱུར་ཏེ།
en: “They are prepared for liberation.

source: །ནགས་ཁྲོད་གནས་ཤིང་རྣམ་གྲོལ་དེ་སྟེན་པས། །རྣམ་གྲོལ་ཞི་བ་མྱུར་དུ་དེས་རྟོགས་འགྱུར།
en: They will quickly attain the peace of liberation. They dwell in the forest and are close to liberation.

source: །འདི་ཀུན་དགོན་པར་གནས་པའི་ཡོན་ཏན་ཡིན།
en: Those who dwell in solitude will have all these qualities. {76}

source: །གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསོད་སྙོམས་སྤྱོད་པ་སྦྱངས་པའི་ཡོན་ཏན་ཡོ་བྱད་བསྙུངས་པ་ལ་གནས་པའི་ཕན་ཡོན་ནི་འདི་བཅུ་སྟེ།
en: “Young man, there are ten benefits for bodhisattva mahāsattvas who live by receiving alms in the austerity of the disciplines of mendicancy.

source: དེ་ཤེས་ཀྱི་ཁེ་འདོད་པ་མ་ཡིན་པ་དང་། དེ་སྙན་པ་འདོད་པ་མ་ཡིན་པ་དང་། དེ་རྙེད་པ་དང་བཀུར་སྟི་འདོད་པ་མ་ཡིན་པ་དང་། དེ་འཕགས་པའི་རིགས་བཞི་ལ་གནས་པ་དང་། དེ་ཚུལ་འཆོས་པ་དང་ཁ་གསག །མེད་པར་འགྱུར་བ་དང་། དེ་བདག་ལ་མི་སྟོད་གཞན་ལ་མི་སྨོད་པ་དང་། དེ་རྗེས་སུ་ཆགས་པ་དང་ཁོང་ཁྲོ་བ་སྤངས་པས་གཞན་གྱི་ཁྱིམ་དུ་སྤྱོད་པ་དང་། ཟང་ཟིང་མེད་པར་ཆོས་ཀྱི་སྦྱིན་པ་སྦྱིན་པར་བྱེད་པ་དང་དེ་སྦྱངས་པའི་ཡོན་ཏན་ཡོ་བྱད་བསྙུངས་པ་ལ་གནས་ཤིང་ཆོས་བསྟན་པ་གཟུང་བར་འགྱུར་བ་ཡིན་ཏེ།
en: they have no desire for honors or gains; [4] they remain within the four noble families; [5] they have no hypocrisy or boasting; [6] they do not praise themselves; [7] they do not criticize others; [8] they engage with households without aversion or attachment; [9] they give the Dharma without expectation of a reward; and [10] the Dharma they teach while remaining in the austerity of the disciplines of mendicancy will be remembered.

source: གཞོན་ནུ་བཅུ་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསོད་སྙོམས་སྤྱོད་པ་སྦྱངས་པའི་ཡོན་ཏན་ཡོ་བྱད་བསྙུངས་པ་ལ་གནས་པའི་ཕན་ཡོན་ནོ། །དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ། སྦྱངས་པ་དག་ལ་གང་གནས་པ།
en: “Young man, those are the ten benefits for bodhisattva mahāsattvas who live by receiving alms in the austerity of the disciplines of mendicancy.” On this topic, it was said:

source: །ཤེས་ཀྱི་ཁེ་ཡང་མི་འདོད་ཅིང་།
en: “They have no desire for a reputation.

source: །སྙན་པ་ལ་ཡང་མི་སྨོན་ཏེ།
en: They do not wish for fame. Those who remain in the disciplines of mendicancy

source: །རྙེད་དང་མ་རྙེད་མཚུངས་པའི་ཡིད། །སྦྱངས་པ་དག་ལ་གང་གནས་པ།
en: Are indifferent to gain and loss. {77}

source: །འཕགས་པའི་རིགས་ནི་མི་གཏོང་ཞིང་། །ཚུལ་འཆོས་པ་དང་ཁ་གསག་རྣམས། །ཐམས་ཅད་རིང་དུ་རྣམ་པར་སྤོང་།
en: “They do not abandon the noble family. They have no hypocrisy or boastfulness.

source: །བདག་ཉིད་ལ་ནི་མི་སྟོད་ཅིང་།
en: They do not praise themselves

source: །གཞན་དག་ལ་ཡང་སྨོད་མི་བྱེད།
en: And they do not criticize others. {78}

source: །ཁོང་ཁྲོ་རྗེས་སུ་ཆགས་མེད་ཅིང་།
en: “They have no attachment or aversion,

source: །ཟང་ཟིང་མེད་པར་ཆོས་སྟོན་ཏེ།
en: And teach the Dharma with no thought of reward.

source: །དེ་ཡི་ཚིག་ཀྱང་གཟུང་བར་འགྱུར།
en: The words they speak will be remembered.

source: །བསོད་སྙོམས་ཡོན་ཏན་འདི་དག་གོ།
en: Recipients of alms will have those qualities. {79}

source: །ཤེས་ཀྱི་ཁེ་དང་སྙན་དང་རྙེད་མི་ཚོལ།
en: “They do not seek reputation, fame, or gain.

source: །འཕགས་པའི་རིགས་བཞི་ལ་ནི་གནས་འགྱུར་ཏེ།
en: They remain within the four noble families.

source: །མཁས་པ་ཚུལ་འཆོས་ཁ་གསག་མེད་པ་ཡིན།
en: The wise ones are neither hypocritical nor boastful.

source: །སྦྱངས་ལ་བརྩོན་པའི་ཡོན་ཏན་འདི་འདྲའོ།
en: Those are the qualities of dedication to mendicancy. {80}

source: །བདག་ལ་མི་སྟོད་གཞན་ལ་མི་སྨོད་ཅིང་།
en: “They do not praise themselves or criticize others.

source: །རྩུབ་པོར་སྨྲས་ཀྱང་འཁྲུག་པར་ཡོང་མི་འགྱུར།
en: They are not upset when spoken to harshly.

source: །བསྔགས་པ་ཐོས་ཀྱང་དགའ་བ་མི་སྐྱེད་དེ།
en: They are not delighted when they hear themselves praised.

source: །དེ་ནི་བསོད་སྙོམས་དག་གིས་མགུ་བར་འགྱུར།
en: Recipients of alms will have that contentment. {81}

source: །ཆོས་ཀྱི་སྦྱིན་པ་ཟང་ཟིང་མེད་པར་སྦྱིན།
en: “They give the gift of the Dharma without thought of reward.

source: །དེ་ནི་རྙེད་དང་བཀུར་སྟི་མི་ཚོལ་ཏེ།
en: They do not search for fame or gain.

source: །དེ་ཡིས་བཤད་པ་དག་ཀྱང་གཟུང་བར་འགྱུར།
en: The words they speak will be remembered.

source: །སྦྱངས་པར་བརྩོན་པའི་ཕན་ཡོན་འདི་དག་ཡིན།
en: Those are the benefits that come from dedication to mendicancy. {82}

source: །གཞོན་ནུ་དེ་ལྟ་བུའི་ཆོས་ཀྱི་ཡོན་ཏན་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགོན་པ་ལ་གནས་པ་ནི་སངས་རྒྱས་ཀྱི་གཏེར་རྙེད་པར་འགྱུར། ཆོས་ཀྱི་གཏེར་རྙེད་པར་འགྱུར། ཡེ་ཤེས་ཀྱི་གཏེར་རྙེད་པར་འགྱུར། སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་དང་ད་ལྟར་བྱུང་བ་ཤེས་པའི་གཏེར་རྙེད་པར་འགྱུར་རོ།
en: “Young man, bodhisattva mahāsattvas who dwell in solitude while maintaining those qualities of the Dharma will obtain the treasure of the buddhas, they will obtain the treasure of the Dharma, they will obtain the treasure of wisdom, and they will obtain the treasure of knowing the past, the future, and the present.

source: །གཞོན་ནུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་གཏེར་རྙེད་པར་འགྱུར་ཞེ་ན།
en: “Young man, how do bodhisattva mahāsattvas obtain the treasure of the buddhas?

source: གཞོན་ནུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དབེན་པ་ན་སྤྱོད་ཅིང་དགོན་པར་གནས་ནས་མངོན་པར་ཤེས་པ་ལྔ་འཐོབ་སྟེ།
en: Young man, bodhisattva mahāsattvas who practice alone, who dwell in solitude, will attain the five higher cognitions.

source: ལྔ་གང་ཞེ་ན།
en: What are the five higher cognitions?

source: འདི་ལྟ་སྟེ། ལྷའི་མིག་དང་ལྷའི་རྣ་བ་དང་ཕ་རོལ་གྱི་སེམས་ཤེས་པ་དང་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་དང་རྫུ་འཕྲུལ་གྱི་ཡུལ་ཏེ།
en: They are divine sight, divine hearing, the knowledge of others’ minds, remembering past lives, and possessing miraculous powers.

source: གཞོན་ནུ་མངོན་པར་ཤེས་པ་འདི་ལྔ་ཐོབ་པར་འགྱུར་རོ།
en: Young man, those are the five higher cognitions that are obtained.

source: །དེ་མིའི་ལས་འདས་པའི་ལྷའི་མིག་གིས་ཤར་ཕྱོགས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གྲངས་མེད་དཔག་ཏུ་མེད་པ་རྣམས་མཐོང་ངོ་།
en: Through divine vision, which transcends human vision, the countless, innumerable buddha bhagavāns in the eastern direction are seen.

source: །དེ་བཞིན་དུ་ལྷོ་དང་ནུབ་དང་བྱང་ཕྱོགས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གྲངས་མེད་དཔག་ཏུ་མེད་པ་རྣམས་མཐོང་སྟེ།
en: In the same way the countless, innumerable buddha bhagavāns in the southern, western, and northern directions are seen.

source: དེ་སངས་རྒྱས་མཐོང་བ་དང་མི་འབྲལ་བར་འགྱུར་རོ།
en: They constantly have this vision of the buddhas.

source: །གཞོན་ནུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་གཏེར་རྙེད་པ་ཡིན་ནོ།
en: Young man, in that way the bodhisattva mahāsattvas obtain the treasure of the buddhas.

source: །གཞོན་ནུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱི་གཏེར་རྙེད་པ་ཡིན་ཞེ་ན།
en: “Young man, how do bodhisattva mahāsattvas obtain the treasure of the Dharma?

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཕྱོགས་བཅུ་ན་ཆོས་ཅི་སྟོན་པ་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ལྷའི་རྣ་བའི་ཁམས་ཀྱིས་ཐོས་ཏེ།
en: The bodhisattva mahāsattvas hear with their divine hearing the Dharma that is taught by those buddha bhagavāns in the ten directions.

source: དེ་ཆོས་ཉན་པ་དང་མི་འབྲལ་བར་འགྱུར་རོ།
en: They are constantly hearing the Dharma.

source: །གཞོན་ནུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱི་གཏེར་རྙེད་པ་ཡིན་ནོ།
en: Young man, in that way the bodhisattva mahāsattvas obtain the treasure of the Dharma.

source: །གཞོན་ནུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡེ་ཤེས་ཀྱི་གཏེར་རྙེད་པ་ཡིན་ཞེ་ན།
en: “Young man, how do the bodhisattva mahāsattvas obtain the treasure of wisdom?

source: གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡེ་ཤེས་དེ་དང་ལྡན་པས་ཆོས་ཐམས་ཅད་འཛིན་ཏེ།
en: Young man, the bodhisattva mahāsattvas who have that wisdom obtain the entire Dharma.

source: ཀུན་བཟུང་ནས་མི་བརྗེད་ཅིང་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ། གང་གི་དོན་གང་ཡིན་པ་དེ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: They do not forget anything that they have obtained, and teach the Dharma to beings, knowing what will be beneficial for any one person.

source: །གཞོན་ནུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡེ་ཤེས་ཀྱི་གཏེར་རྙེད་པ་ཡིན་ནོ།
en: Young man, in that way bodhisattva mahāsattvas obtain the treasure of wisdom.

source: །གཞོན་ནུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་དང་། ད་ལྟར་བྱུང་བ་ཤེས་པའི་གཏེར་རྙེད་པ་ཡིན་ཞེ་ན།
en: “Young man, how do bodhisattva mahāsattvas obtain the treasure of knowing the past, the future, and the present?

source: དེ་མངོན་པར་ཤེས་པས་འདས་པ་དང་མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་། སྤྱོད་པ་ཤེས་པ་ལ་འཇུག་སྟེ།
en: Through the higher cognitions they gain the knowledge of the minds and conduct of all beings in the past, the future, and the present.
